app/Http/Controllers/PageController.php

select * from `networks`
---
    public function show($company){
        $company = Company::find($company);
        $networks = Network::all();